shunzi-ycsb/level1B_ycsb_load.log
./leveldb/release/db_bench --cache_size=8388608 --db=/mnt/shunzi/test-data/wipdb/level_ycsb --threads=4 --open_files=40000 --num=120000000 --range=120000000 --reads=2000000 --batch_size=1000 --stats_interval=10000000 --bloom_bits=16 --value_size=100 --histogram=true --log=true --benchmarks=load,overwrite,stats --writes=10000000 --ycsb_ops_num=8000000 --seek_nexts=100 --use_existing_db=false --print_wa=true --write_buffer_size=67108864 --max_file_size=67108864 
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    120000000
RawSize:    13275.1 MB (estimated)
FileSize:   7553.1 MB (estimated)
------------------------------------------------
FLAGS_num 120000000, num_ 120000000
num after by threads 30000000
2022/06/30-11:48:21  ... thread 0: (10000000,10000000) ops and (514425.8,514425.8) ops/second in (19.439150,19.439150) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        8      410         6        0       975
  1        0        0         4      564       613
  2        3      197         4      678       728
  3        8      465         2      329       328
WriteAmplification: 2.7118

2022/06/30-11:48:49  ... thread 0: (10000000,20000000) ops and (348171.5,415277.0) ops/second in (28.721479,48.160629) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       11      564        13        0      2155
  1        0        0        11     1590      1631
  2       13      819        12     2088      2136
  3       14      859         7     1313      1312
WriteAmplification: 3.3570

2022/06/30-11:49:34  ... thread 0: (10000000,30000000) ops and (222851.9,322464.5) ops/second in (44.872857,93.033486) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        9      462        21        0      3284
  1        1       66        20     2822      2853
  2       13      806        21     3648      3695
  3       31     2021        25     4551      4546
WriteAmplification: 4.3782

2022/06/30-11:50:26  ... thread 0: (10000000,40000000) ops and (195093.6,277217.7) ops/second in (51.257438,144.290924) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        7      359        27        0      4412
  1        7      413        29     4053      4074
  2        9      479        28     4897      4942
  3       45     2951        53     9493      9481
  4        4      263         0        0         0
WriteAmplification: 5.1921

2022/06/30-11:51:25  ... thread 0: (10000000,50000000) ops and (168988.3,245740.6) ops/second in (59.175694,203.466618) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        5      257        34        0      5541
  1        6      347        37     5285      5296
  2       10      545        36     6326      6369
  3       46     2980        84    15222     15203
  4       22     1447         3      592       591
WriteAmplification: 5.9555

2022/06/30-11:52:17  ... thread 0: (10000000,60000000) ops and (191258.6,234602.4) ops/second in (52.285228,255.751846) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        3      154        41        0      6670
  1        6      347        46     6516      6517
  2       10      545        44     7875      7916
  3       47     2944       110    20081     20057
  4       41     2698         4      723       723
WriteAmplification: 6.2796

2022/06/30-11:53:14  ... thread 0: (10000000,70000000) ops and (175062.6,223732.0) ops/second in (57.122418,312.874264) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       51        48        0      7799
  1       10      611        55     7747      7739
  2        6      282        54     9685      9725
  3       48     2996       138    25141     25113
  4       59     3860         6     1053      1052
WriteAmplification: 6.5944

2022/06/30-11:53:57  ... thread 0: (10000000,80000000) ops and (231287.8,224649.4) ops/second in (43.236167,356.110431) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       11      564        55        0      8927
  1        1       18        59     8363      8350
  2       12      720        64    11356     11393
  3       48     3075       158    28821     28788
  4       70     4540         6     1053      1052
WriteAmplification: 6.5541

2022/06/30-11:54:56  ... thread 0: (10000000,90000000) ops and (172013.6,217262.5) ops/second in (58.134940,414.245371) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        9      462        62        0     10056
  1        0        0        68     9613      9589
  2       14      872        74    13181     13216
  3       48     2976       183    33322     33285
  4       88     5720        12     2229      2227
WriteAmplification: 6.7993

2022/06/30-11:55:59  ... thread 0: (10000000,100000000) ops and (157735.3,209361.5) ops/second in (63.397344,477.642715) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        7      359        69        0     11185
  1        2      132        77    10844     10811
  2       13      777        83    14810     14843
  3       48     2944       205    37388     37345
  4      108     6927        27     5170      5167
WriteAmplification: 7.0946

2022/06/30-11:57:07  ... thread 0: (10000000,110000000) ops and (147287.6,201636.1) ops/second in (67.894386,545.537101) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        5      257        75        0     12313
  1        3      197        85    12075     12033
  2       12      698        91    16363     16394
  3       47     2986       230    41928     41880
  4      126     8110        45     8447      8441
WriteAmplification: 7.3952

2022/06/30-11:58:22  ... thread 0: (10000000,120000000) ops and (133584.7,193424.8) ops/second in (74.858893,620.395994) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        4      205        82        0     13493
  1        9      545        94    13307     13254
  2        6      329       100    18043     18072
  3       50     2967       258    47083     47030
  4      146     9363        64    12145     12136
WriteAmplification: 7.7064

load         :       5.170 micros/op 193424 ops/sec;   21.4 MB/s
Microseconds per op:
Count: 120000000 Average: 5.1700  StdDev: 33.86
Min: 0  Median: 0.5007  Max: 30782534
Percentiles: P50: 0.50 P75: 0.75 P99: 0.99 P99.9: 392.32 P99.99: 3732.83
------------------------------------------------------
[       0,       1 ] 119841678  99.868%  99.868% ####################
(       1,       2 ]    17700   0.015%  99.883% 
(       2,       3 ]     4928   0.004%  99.887% 
(       3,       4 ]     2423   0.002%  99.889% 
(       4,       6 ]     5092   0.004%  99.893% 
(       6,      10 ]     5690   0.005%  99.898% 
(      10,      15 ]     1495   0.001%  99.899% 
(      15,      22 ]      582   0.000%  99.900% 
(      22,      34 ]      230   0.000%  99.900% 
(      34,      51 ]       62   0.000%  99.900% 
(      51,      76 ]       27   0.000%  99.900% 
(      76,     110 ]        3   0.000%  99.900% 
(     110,     170 ]       23   0.000%  99.900% 
(     170,     250 ]       30   0.000%  99.900% 
(     250,     380 ]       12   0.000%  99.900% 
(     380,     580 ]      406   0.000%  99.900% 
(     580,     870 ]     2503   0.002%  99.902% 
(     870,    1300 ]    18836   0.016%  99.918% 
(    1300,    1900 ]    38014   0.032%  99.950% 
(    1900,    2900 ]    35878   0.030%  99.980% 
(    2900,    4400 ]    22312   0.019%  99.998% 
(    4400,    6600 ]     1403   0.001%  99.999% 
(    6600,    9900 ]      153   0.000% 100.000% 
(    9900,   14000 ]       56   0.000% 100.000% 
(   14000,   22000 ]      178   0.000% 100.000% 
(   22000,   33000 ]      175   0.000% 100.000% 
(   33000,   50000 ]       76   0.000% 100.000% 
(   50000,   75000 ]       13   0.000% 100.000% 
(   75000,  110000 ]        2   0.000% 100.000% 
( 2900000, 4300000 ]        1   0.000% 100.000% 
( 6500000, 9800000 ]        1   0.000% 100.000% 
( 9800000, 14000000 ]        7   0.000% 100.000% 
( 14000000, 22000000 ]        7   0.000% 100.000% 
( 22000000, 33000000 ]        4   0.000% 100.000% 

FLAGS_num 120000000, num_ 10000000
num after by threads 30000000
2022/06/30-12:02:49  ... thread 0: (10000000,10000000) ops and (37456.9,37456.9) ops/second in (266.973793,266.973793) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        8      410       110        0     18009
  1        1        6       124    17617     17442
  2       10      595       132    23939     23889
  3       58     3175       361    66158     65447
  4      191    12352       131    25067     24533
WriteAmplification: 8.2914

2022/06/30-12:02:49  ... thread 2: (10000000,10000000) ops and (37455.5,37455.5) ops/second in (266.983621,266.983621) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        8      410       110        0     18009
  1        1        6       124    17617     17442
  2       10      595       132    23939     23889
  3       58     3175       361    66158     65447
  4      191    12352       131    25067     24533
WriteAmplification: 8.2914

2022/06/30-12:02:49  ... thread 3: (10000000,10000000) ops and (37454.1,37454.1) ops/second in (266.993279,266.993279) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        8      410       110        0     18009
  1        1        6       124    17617     17442
  2       10      595       132    23939     23889
  3       58     3175       361    66158     65447
  4      191    12352       131    25067     24533
WriteAmplification: 8.2914

2022/06/30-12:02:49  ... thread 1: (10000000,10000000) ops and (37452.7,37452.7) ops/second in (267.003262,267.003262) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        8      410       110        0     18009
  1        1        6       124    17617     17442
  2       10      595       132    23939     23889
  3       58     3175       361    66158     65447
  4      191    12352       131    25067     24533
WriteAmplification: 8.2914

overwrite    :       6.675 micros/op 149805 ops/sec;   16.6 MB/s (10000000 ops)
Microseconds per op:
Count: 40000000 Average: 26.6988  StdDev: 104.65
Min: 0  Median: 0.5016  Max: 19520676
Percentiles: P50: 0.50 P75: 0.75 P99: 0.99 P99.9: 2900.00 P99.99: 21083.49
------------------------------------------------------
[       0,       1 ] 39874704  99.687%  99.687% ####################
(       1,       2 ]    37154   0.093%  99.780% 
(       2,       3 ]    18700   0.047%  99.826% 
(       3,       4 ]    12105   0.030%  99.857% 
(       4,       6 ]     1546   0.004%  99.861% 
(       6,      10 ]     1351   0.003%  99.864% 
(      10,      15 ]    11152   0.028%  99.892% 
(      15,      22 ]     1933   0.005%  99.897% 
(      22,      34 ]      677   0.002%  99.898% 
(      34,      51 ]      387   0.001%  99.899% 
(      51,      76 ]      256   0.001%  99.900% 
(      76,     110 ]       13   0.000%  99.900% 
(     110,     170 ]        1   0.000%  99.900% 
(     170,     250 ]        4   0.000%  99.900% 
(     250,     380 ]        6   0.000%  99.900% 
(     380,     580 ]        4   0.000%  99.900% 
(     580,     870 ]        4   0.000%  99.900% 
(     870,    1300 ]        3   0.000%  99.900% 
(    2900,    4400 ]        6   0.000%  99.900% 
(    4400,    6600 ]      131   0.000%  99.900% 
(    6600,    9900 ]     1267   0.003%  99.904% 
(    9900,   14000 ]    11062   0.028%  99.931% 
(   14000,   22000 ]    26579   0.066%  99.998% 
(   22000,   33000 ]      497   0.001%  99.999% 
(   33000,   50000 ]      330   0.001% 100.000% 
(   50000,   75000 ]       92   0.000% 100.000% 
(   75000,  110000 ]        8   0.000% 100.000% 
( 6500000, 9800000 ]        2   0.000% 100.000% 
( 9800000, 14000000 ]        6   0.000% 100.000% 
( 14000000, 22000000 ]       20   0.000% 100.000% 

FLAGS_num 120000000, num_ 10000000
num after by threads 30000000

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        8      410       110        0     18009
  1        1        6       124    17617     17442
  2       10      595       132    23939     23889
  3       58     3175       361    66158     65447
  4      191    12352       131    25067     24533
WriteAmplification: 8.2914